In this assigment, we going to scrap a site and draw insights from it 

* using the url above webscrap the financial website and load it in a pandas Dataframe 
* load it in df and draw out 3  insights from the data

In [155]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
import requests
from bs4 import BeautifulSoup

In [156]:
url = "https://www.worlddata.info/africa/nigeria/inflation-rates.php"
r = requests.get(url)
content = BeautifulSoup(r.content, 'html.parser')
#content

In [157]:
for rows in content.find_all('tr')[0]:
    print(rows.text)

Year
Nigeria
Ø EU
Ø USA
Ø World

In [158]:
header = []
for rows in content.find_all('tr')[0]:
    header.append(rows.text)
df = pd.DataFrame(columns = header)

table_rows = content.find_all('tr')[:1]
list_row = []
for i in range(3,len(table_rows)):
    row_level = table_rows[i]
    row_level_list = []
    for rows in row_level:
        row_level_list.append(rows.text)
    list_row.append(row_level_list)
for final_row in list_row:
    df.loc[:, -1] = final_row
    df.iloc[df.shape[0:]] = final_row

In [159]:
df

Empty DataFrame
Columns: [Year, Nigeria, Ø EU, Ø USA, Ø World]
Index: []

In [160]:
list_row = []
for header in content.find_all('th'):
    list_row.append(header.text)
    
df = pd.DataFrame(columns= list_row)
row_team = []
tr = content.find_all('tr')
list_of_rows = []
for table_row in range(1,len(tr)):
    list_for_each_row = []
    tr_small = tr[table_row]
    for row in tr_small:
        list_for_each_row.append(row.text)
        list_of_rows.append(list_for_each_row)
        
for i in list_of_rows:
    df.loc[len(df)] = i

In [161]:
df.head()

   Year  Nigeria    Ø EU   Ø USA Ø World
0  2021  16.95 %  2.55 %  4.70 %  3.42 %
1  2021  16.95 %  2.55 %  4.70 %  3.42 %
2  2021  16.95 %  2.55 %  4.70 %  3.42 %
3  2021  16.95 %  2.55 %  4.70 %  3.42 %
4  2021  16.95 %  2.55 %  4.70 %  3.42 %

In [162]:
# checking for the shape of my data
df.shape

(310, 5)

In [163]:
# checking for datatypes
df.dtypes

Year       object
Nigeria    object
Ø EU       object
Ø USA      object
Ø World    object
dtype: object

In [164]:
# checking the column
df.columns

Index(['Year', 'Nigeria', 'Ø EU', 'Ø USA', 'Ø World'], dtype='object')

In [165]:
# renaming the column name to remove Ø sign
df.rename(columns= {'Ø EU': 'EU',
                   'Ø USA': 'USA',
                  'Ø World': 'World'}, inplace=True)

In [166]:
pd.set_option('display.max_rows', None) 
df.head(5)

   Year  Nigeria      EU     USA   World
0  2021  16.95 %  2.55 %  4.70 %  3.42 %
1  2021  16.95 %  2.55 %  4.70 %  3.42 %
2  2021  16.95 %  2.55 %  4.70 %  3.42 %
3  2021  16.95 %  2.55 %  4.70 %  3.42 %
4  2021  16.95 %  2.55 %  4.70 %  3.42 %

In [167]:
df.tail(5) # there are NA values in the 'World' column

     Year Nigeria      EU     USA World
305  1960  5.44 %  1.74 %  1.46 %   n/a
306  1960  5.44 %  1.74 %  1.46 %   n/a
307  1960  5.44 %  1.74 %  1.46 %   n/a
308  1960  5.44 %  1.74 %  1.46 %   n/a
309  1960  5.44 %  1.74 %  1.46 %   n/a

In [169]:
# saving my dataset 
df.to_csv("C:/Users/STUTERN/Desktop/Intermediate_project/week7/nigeria_inflation_rate.csv")

In [170]:
df.World.value_counts().head()

n/a       100
2.19 %     10
4.82 %     10
7.15 %      5
9.15 %      5
Name: World, dtype: int64

In [171]:
df1 = pd.read_csv("C:/Users/STUTERN/Desktop/Intermediate_project/week7/nigeria_inflation_rate.csv", index_col=0)

In [172]:
df1.tail(5)

     Year Nigeria      EU     USA World
305  1960  5.44 %  1.74 %  1.46 %   NaN
306  1960  5.44 %  1.74 %  1.46 %   NaN
307  1960  5.44 %  1.74 %  1.46 %   NaN
308  1960  5.44 %  1.74 %  1.46 %   NaN
309  1960  5.44 %  1.74 %  1.46 %   NaN

In [175]:
df1["World"].fillna("2.19 %", inplace = True)

In [176]:
df1.tail()

     Year Nigeria      EU     USA   World
305  1960  5.44 %  1.74 %  1.46 %  2.19 %
306  1960  5.44 %  1.74 %  1.46 %  2.19 %
307  1960  5.44 %  1.74 %  1.46 %  2.19 %
308  1960  5.44 %  1.74 %  1.46 %  2.19 %
309  1960  5.44 %  1.74 %  1.46 %  2.19 %

In [177]:
#Removing the % sign from the values
cols = ['Nigeria','EU','USA','World']
df1[cols] = df1[cols].replace({'%': '',}, regex=True)

In [181]:
df1.head()

   Year Nigeria     EU    USA  World
0  2021  16.95   2.55   4.70   3.42
1  2021  16.95   2.55   4.70   3.42
2  2021  16.95   2.55   4.70   3.42
3  2021  16.95   2.55   4.70   3.42
4  2021  16.95   2.55   4.70   3.42

Data Exploration
Draw out five insights from the data
1. Which year has the highest and lowest inflation rate in Nigeria
2. Compare the inflation rate between Nigeria and EU
3. Compare the inflation rate between Nigeria and USA
4. Compare the inflation rate between Nigeria and World
5. How does historical inflation compare to recent inflation rates?